{
  "backend/main.mo": "Actor managing user profiles with membership types and access control, providing queries and updates for caller profiles.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to relevant frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend components, pages, hooks, and styling files.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and layout tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Root React component handling routing, providers, and rendering pages inside AppShell.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart items, totals, and operations like add, remove, and clear.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for Product and CartItem used in cart functionality.",
  "frontend/src/cart/useCart.ts": "Hook exposing the cart context and enforcing provider usage.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper with header, logo, auth button, and bottom navigation including cart badge.",
  "frontend/src/components/AuthButton.tsx": "Sign-in/out button integrating Internet Identity with query cache clearing and toast feedback.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users for a display name and creating an initial profile.",
  "frontend/src/components/RequireAuth.tsx": "Guard component showing a sign-in prompt when user authentication is missing.",
  "frontend/src/data/products.ts": "Defines a static list of product objects with IDs, descriptions, pricing, and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication and state, including login and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks to fetch and update user profiles and membership types via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and theme variables for styling, including light and dark mode settings.",
  "frontend/src/lib/format.ts": "Exports a helper to format numbers as USD currency strings.",
  "frontend/src/lib/membershipPlanUrls.ts": "Maps membership types to external subscription URLs and provides a lookup function.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart page, listing items, totals, and actions to remove items.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero content, feature sections, an about section, and footer.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Static membership plans page displaying three tiers with features, pricing, and subscribe links.",
  "frontend/src/pages/MembershipsPage.tsx": "Interactive membership plan selector integrating authentication, backend updates, and external payment URLs.",
  "frontend/src/pages/ProductsPage.tsx": "Gourmet products catalog showing product details and allowing users to add items to the cart.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying account info, membership status, and prompting profile setup when needed.",
  "frontend/src/pages/TermsPage.tsx": "Terms and conditions page presenting scrollable legal text and membership rules.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors via CSS variables, extended fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing the LE GOURMAND mobile app scope, architectural notes, existing features, and issues, including expansion to products and cart with Firebase auth."
}