{
  "backend/main.mo": "Motoko canister managing authenticated user profiles with membership types using access control and CRUD-like operations.",
  "feature_evidence.json": "Feature evidence report listing product expansion, placeholder images, and cart behavior requirements with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, hooks, and styling utilities across the app.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme CSS variables with OKLCH color tokens and global element styling.",
  "frontend/index.html": "HTML entry point providing root element and loading main React script.",
  "frontend/src/App.tsx": "Main React app handling client-side routing across pages, providing theme, query, and cart context providers.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart items, totals, and update operations with memoized state.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for Product and CartItem used in the cart system.",
  "frontend/src/cart/useCart.ts": "Hook exposing cart context with a safety guard to ensure proper provider usage.",
  "frontend/src/components/AppShell.tsx": "App layout with header, footer navigation, and dynamic cart badge integrated with route navigation.",
  "frontend/src/components/AuthButton.tsx": "Authentication button handling Internet Identity login/logout with toast notifications and query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for first‑time profile creation, submitting display name and default membership type via backend hook.",
  "frontend/src/components/RequireAuth.tsx": "Wrapper component that requires an authenticated Internet Identity and shows a sign‑in card if missing.",
  "frontend/src/data/products.ts": "Exports a static list of gourmet product definitions with pricing and image metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and membership selections via the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for theming and typography.",
  "frontend/src/lib/format.ts": "Formats numbers as USD currency strings.",
  "frontend/src/lib/membershipPlanUrls.ts": "Maps membership types to external subscription URLs and exposes a lookup helper.",
  "frontend/src/lib/utils.ts": "Utility function to merge Tailwind class names with clsx and twMerge.",
  "frontend/src/main.tsx": "Root render file that sets up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with remove actions and order summary, using cart state and currency formatting.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero text, feature highlights, an about section, and a footer with a link to caffeine.ai.",
  "frontend/src/pages/MembershipPlansPage.tsx": "Displays three subscription plans with pricing, features, and a subscribe handler that redirects to external URLs.",
  "frontend/src/pages/MembershipsPage.tsx": "Shows membership tiers integrated with Internet Identity, allowing users to select plans and persist the choice via backend mutations.",
  "frontend/src/pages/ProductsPage.tsx": "Renders a grid of products with images, prices, and an option to add items to the cart with toast notifications.",
  "frontend/src/pages/ProfilePage.tsx": "Authenticated profile page showing user details, membership status, and conditional setup prompts.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page with scrollable legal sections outlining membership rules and policies.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params from query or hash, persisting them in sessionStorage, and clearing stored or hash-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining dark mode, content paths, extended theme colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing app scope, design requirements, product image needs, known issues, and existing features."
}