{
  "kind": "build_request",
  "title": "Add the user-provided additional gourmet products to the Products catalog with distinct placeholder images",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Expand the static products catalog in `frontend/src/data/products.ts` by adding all additional gourmet products provided by the user (in addition to the existing 3 products), so they appear in the existing Products screen without any UI restructuring.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add them to the products window"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/data/products.ts` contains the original 3 products plus new entries for each user-provided product name: Beluga caviar; Jamón ibérico de bellota; Duck foie gras; Premium saffron threads; Manuka honey UMF 20+; Specialty microlot coffee; Silver Needle white tea; Madagascar Bourbon vanilla; Alba white truffle; Smoked sea salt flakes; Traditional Balsamic Vinegar of Modena DOP; Black truffle oil; Artisanal bronze-cut pasta; Aged Carnaroli rice; Wild berry gourmet jam; French whole-grain mustard; Natural fermentation artisanal panettone.",
        "Each new product entry includes all required `Product` fields (`id`, `name`, `description`, `price`, `imageSrc`, `altText`) as defined in `frontend/src/cart/cartTypes.ts`.",
        "Each new product has a unique, stable `id` suitable for use as a React key and cart identifier (no duplicates across the full catalog).",
        "The Products screen (`frontend/src/pages/ProductsPage.tsx`) renders the expanded catalog by mapping over `products` with no runtime errors."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add distinct placeholder images for each newly added product as static assets under `frontend/public/assets/generated/`, and reference them from the corresponding `imageSrc` fields in `frontend/src/data/products.ts`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "diferent images if it is posible",
          "yes you must but do it now!!!"
        ]
      },
      "acceptanceCriteria": [
        "For each newly added product, `imageSrc` points to a unique path under `/assets/generated/` and the referenced file exists under `frontend/public/assets/generated/`.",
        "All new product images load correctly in the Products screen (no broken image links).",
        "Each new product includes a specific, descriptive `altText` that matches the product shown (not reused across multiple products)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Keep existing cart behavior intact so that any of the newly added products can be added to the cart from the Products screen and viewed/totaled in the Cart screen using the existing shared client-side cart state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add them to the products window"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the “Add to Cart” button on any newly added product adds that product to the cart and shows the existing success toast pattern.",
        "The Cart screen displays newly added products correctly (name, quantity, and totals behave the same as for the original products).",
        "Removing newly added products from the cart works and updates totals correctly."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (read-only UI components must be composed, not modified).",
    "Do not add any backend or payment/subscription logic as part of this catalog expansion."
  ],
  "nonGoals": [
    "Implementing inventory, product search/filtering, categories, pagination, or checkout/payment processing.",
    "Persisting cart contents to the backend."
  ],
  "imageRequirements": {
    "required": [
      "Beluga caviar placeholder product image (product-beluga-caviar.dim_1024x1024.png)",
      "Jamón ibérico de bellota placeholder product image (product-jamon-iberico-bellota.dim_1024x1024.png)",
      "Duck foie gras placeholder product image (product-duck-foie-gras.dim_1024x1024.png)",
      "Premium saffron threads placeholder product image (product-saffron-threads.dim_1024x1024.png)",
      "Manuka honey placeholder product image (product-manuka-honey-umf20.dim_1024x1024.png)",
      "Specialty microlot coffee placeholder product image (product-microlot-coffee.dim_1024x1024.png)",
      "Silver Needle white tea placeholder product image (product-silver-needle-tea.dim_1024x1024.png)",
      "Madagascar Bourbon vanilla placeholder product image (product-madagascar-vanilla.dim_1024x1024.png)",
      "Alba white truffle placeholder product image (product-alba-white-truffle.dim_1024x1024.png)",
      "Smoked sea salt flakes placeholder product image (product-smoked-sea-salt-flakes.dim_1024x1024.png)",
      "Traditional balsamic vinegar placeholder product image (product-traditional-balsamic-vinegar-modena-dop.dim_1024x1024.png)",
      "Black truffle oil placeholder product image (product-black-truffle-oil.dim_1024x1024.png)",
      "Artisanal bronze-cut pasta placeholder product image (product-bronze-cut-pasta.dim_1024x1024.png)",
      "Aged Carnaroli rice placeholder product image (product-aged-carnaroli-rice.dim_1024x1024.png)",
      "Wild berry gourmet jam placeholder product image (product-wild-berry-jam.dim_1024x1024.png)",
      "French whole-grain mustard placeholder product image (product-french-whole-grain-mustard.dim_1024x1024.png)",
      "Artisanal panettone placeholder product image (product-artisanal-panettone.dim_1024x1024.png)"
    ],
    "edits": []
  }
}