{
  "kind": "build_request",
  "title": "Add uploaded logo to app header and fix Select Plan to open in a new tab",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Add the uploaded logo image (\"logo big.png\") as a static frontend asset and display it in the main app header (AppShell) alongside the brand name, keeping the existing dark luxury styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I would like my logo on it"
        ]
      },
      "acceptanceCriteria": [
        "The uploaded file \"logo big.png\" is included in the frontend static assets (served directly by the frontend, not via backend).",
        "The AppShell header (frontend/src/components/AppShell.tsx) renders the logo image with an English alt text (e.g., \"LE GOURMAND logo\").",
        "The header remains visually consistent with the current dark luxury theme (no layout break on mobile; logo is constrained to a reasonable height and does not overflow).",
        "Clicking the header/brand area continues to navigate to Home as it does today."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Fix the \"Select Plan\" button behavior on the Memberships screen so that clicking it opens the plan destination in a new browser tab/window; ensure the new tab/window navigation works reliably (no-op bug), while keeping the existing membership selection persistence behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "there is  a error when I click select plan it should open another window but it doesnt"
        ]
      },
      "acceptanceCriteria": [
        "On the Memberships page (frontend/src/pages/MembershipsPage.tsx), clicking \"Select Plan\" opens a new tab/window via window.open (or equivalent) rather than staying in the same tab.",
        "The destination URL opened for each plan is mapped correctly using these exact URLs: Simple: https://le-gourmand.tiendup.com/p/membresia-simple, Normal: https://le-gourmand.tiendup.com/p/suscripcion-normal, Premium: https://le-gourmand.tiendup.com/p/membresia-premium.",
        "After clicking \"Select Plan\", the app still performs the existing membership selection mutation (persisting membership type for the signed-in user) and continues to show \"Current Plan\" when appropriate.",
        "If the user is not signed in, the existing sign-in prompt/login flow still occurs; the new tab/window behavior does not break the login flow or crash the page.",
        "No Stripe/checkout/payment processing is added; the change is limited to opening the external plan URL in a new tab/window and maintaining the existing membership selection logic."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui; compose them instead.",
    "Backend remains single-actor; do not introduce additional canisters or services.",
    "Use English for any user-facing text that is newly added or modified."
  ],
  "nonGoals": [
    "Do not add payment processing, Stripe checkout, subscription creation, or any backend payment logic.",
    "Do not redesign the app shell or change the overall navigation structure beyond adding the logo and fixing the Select Plan behavior.",
    "Do not implement third-party authentication providers (only existing Internet Identity auth remains)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}